
# State **`s3://infrahouse-aws-control-289256138624/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        5 |          12 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                  |
|:--------:|:-------------------------------------------------------------------------------------------|
|    🟢    | `module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_policy.state-bucke`   |
|    🟢    | `module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_policy.state-bucke`   |
|    🟢    | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_policy.state-bucke`   |
|    🟢    | `module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_policy.state-bucke`   |
|    🟢    | `module.buckets["infrahouse-website-infra"].aws_s3_bucket_policy.state-bucke`              |
|    🟡    | `module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket`         |
|    🟡    | `module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket`         |
|    🟡    | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket`         |
|    🟡    | `module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket`         |
|    🟡    | `module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket`                    |
|    🟡    | `module.github-connector.aws_iam_openid_connect_provider.github`                           |
|    🟡    | `module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager`           |
|    🟡    | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager`           |
|    🟡    | `module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role.state-manager` |
|    🟡    | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager`           |
|    🟡    | `module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager`           |
|    🟡    | `module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role.state-manager`           |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets["infrahouse-aws-control-289256138624"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-289256138624",
              + "arn:aws:s3:::infrahouse-aws-control-289256138624/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-289256138624"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
            "lock_table"        = "infrahouse-aws-control-289256138624-above-asp"
          + "module_version"    = "2.1.3"
            "repo"              = "infrahouse/aws-control-289256138624"
        }
      ~ tags_all                    = {
          + "module_version"    = "2.1.3"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_policy.state-bucke will be created
  + resource "aws_s3_bucket_policy" "state-bucke" {
      + bucket = "infrahouse-aws-control-289256138624"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-303467602807",
              + "arn:aws:s3:::infrahouse-aws-control-303467602807/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-303467602807"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
            "lock_table"        = "infrahouse-aws-control-303467602807-alert-gecko"
          + "module_version"    = "2.1.3"
            "repo"              = "infrahouse/aws-control-303467602807"
        }
      ~ tags_all                    = {
          + "module_version"    = "2.1.3"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_policy.state-bucke will be created
  + resource "aws_s3_bucket_policy" "state-bucke" {
      + bucket = "infrahouse-aws-control-303467602807"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-493370826424",
              + "arn:aws:s3:::infrahouse-aws-control-493370826424/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-493370826424"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
            "lock_table"        = "infrahouse-aws-control-493370826424-content-albacore"
          + "module_version"    = "2.1.3"
            "repo"              = "infrahouse/aws-control-493370826424"
        }
      ~ tags_all                    = {
          + "module_version"    = "2.1.3"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_policy.state-bucke will be created
  + resource "aws_s3_bucket_policy" "state-bucke" {
      + bucket = "infrahouse-aws-control-493370826424"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-aws-control-990466748045",
              + "arn:aws:s3:::infrahouse-aws-control-990466748045/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-990466748045"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
            "lock_table"        = "infrahouse-aws-control-990466748045-ultimate-hermit"
          + "module_version"    = "2.1.3"
            "repo"              = "infrahouse/aws-control"
        }
      ~ tags_all                    = {
          + "module_version"    = "2.1.3"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_policy.state-bucke will be created
  + resource "aws_s3_bucket_policy" "state-bucke" {
      + bucket = "infrahouse-aws-control-990466748045"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.buckets["infrahouse-website-infra"].data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::infrahouse-website-infra",
              + "arn:aws:s3:::infrahouse-website-infra/*",
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-website-infra"
      ~ tags                        = {
            "created_by_module" = "infrahouse/state-bucket/aws"
            "description"       = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
            "lock_table"        = "infrahouse-website-infra-well-pony"
          + "module_version"    = "2.1.3"
            "repo"              = "infrahouse/infrahouse-website-infra"
        }
      ~ tags_all                    = {
          + "module_version"    = "2.1.3"
            # (5 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket_policy.state-bucke will be created
  + resource "aws_s3_bucket_policy" "state-bucke" {
      + bucket = "infrahouse-website-infra"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.github-connector.aws_iam_openid_connect_provider.github will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "github" {
        id              = "arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com"
      ~ tags            = {
          + "created_by_module" = "infrahouse/gh-identity-provider/aws"
          + "module_version"    = "1.0.3"
        }
      ~ tags_all        = {
          + "created_by_module" = "infrahouse/gh-identity-provider/aws"
          + "module_version"    = "1.0.3"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager will be updated in-place
  ~ resource "aws_iam_role" "state-manager" {
        id                    = "ih-tf-aws-control-289256138624-state-manager"
        name                  = "ih-tf-aws-control-289256138624-state-manager"
      ~ tags                  = {
            "created_by_module" = "infrahouse/state-manager/aws"
          + "module_version"    = "1.4.2"
        }
      ~ tags_all              = {
          + "module_version"    = "1.4.2"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager will be updated in-place
  ~ resource "aws_iam_role" "state-manager" {
        id                    = "ih-tf-aws-control-303467602807-state-manager"
        name                  = "ih-tf-aws-control-303467602807-state-manager"
      ~ tags                  = {
            "created_by_module" = "infrahouse/state-manager/aws"
          + "module_version"    = "1.4.2"
        }
      ~ tags_all              = {
          + "module_version"    = "1.4.2"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role.state-manager will be updated in-place
  ~ resource "aws_iam_role" "state-manager" {
        id                    = "ih-tf-aws-control-303467602807-state-manager-read-only"
        name                  = "ih-tf-aws-control-303467602807-state-manager-read-only"
      ~ tags                  = {
            "created_by_module" = "infrahouse/state-manager/aws"
          + "module_version"    = "1.4.2"
        }
      ~ tags_all              = {
          + "module_version"    = "1.4.2"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager will be updated in-place
  ~ resource "aws_iam_role" "state-manager" {
        id                    = "ih-tf-aws-control-493370826424-state-manager"
        name                  = "ih-tf-aws-control-493370826424-state-manager"
      ~ tags                  = {
            "created_by_module" = "infrahouse/state-manager/aws"
          + "module_version"    = "1.4.2"
        }
      ~ tags_all              = {
          + "module_version"    = "1.4.2"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager will be updated in-place
  ~ resource "aws_iam_role" "state-manager" {
        id                    = "ih-tf-aws-control-state-manager"
        name                  = "ih-tf-aws-control-state-manager"
      ~ tags                  = {
            "created_by_module" = "infrahouse/state-manager/aws"
          + "module_version"    = "1.4.2"
        }
      ~ tags_all              = {
          + "module_version"    = "1.4.2"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role.state-manager will be updated in-place
  ~ resource "aws_iam_role" "state-manager" {
        id                    = "ih-tf-infrahouse-website-infra-state-manager"
        name                  = "ih-tf-infrahouse-website-infra-state-manager"
      ~ tags                  = {
            "created_by_module" = "infrahouse/state-manager/aws"
          + "module_version"    = "1.4.2"
        }
      ~ tags_all              = {
          + "module_version"    = "1.4.2"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

Plan: 5 to add, 12 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDUsICJjaGFuZ2UiOiAxMiwgImRlc3Ryb3kiOiAwfX0=
```
</details>